{"name":"apt-chef","version":"0.2.2","description":"Configures apt repository for Chef Software, Inc. products","long_description":"# apt-chef\n\n[![Build Status](https://travis-ci.org/chef-cookbooks/apt-chef.svg?branch=master)](https://travis-ci.org/chef-cookbooks/apt-chef)\n[![Cookbook Version](https://img.shields.io/cookbook/v/apt-chef.svg)](https://supermarket.chef.io/cookbooks/apt-chef)\n\nSets up the default apt package repository for Chef Software, Inc. products.\n\nPrimarily intended to be consumed by the chef-ingredient cookbook.\n\n## Requirements\n\n#### Platforms\n- Only supports Ubuntu. May work on other Debian-family distributions. Other platforms don't make sense with apt repositories.  However, not all platforms that this cookbook will work on have supported packages from the repository. See [supported platforms](https://docs.chef.io/supported_platforms.html). Users may need to override attributes in roles or wrapper cookbooks to get this to work, or write their own cookbooks entirely.\n\n#### Chef\n- Chef 11+\n\n#### Cookbooks\n- apt\n\n\n## Attributes\n\nThe `attributes/default.rb` file contains comments with all the attributes that can be set to control how this cookbook sets up the repository.\n\n## Recipes\n\n### default\n\nUses the attributes in `attributes/default.rb` to control how the repository is configured.\n\n### current\n\nHard-codes Chef's public \"current\" repository. Used for situations where both stable and current repositories are desired.\n\n### stable\n\nHard-codes Chef's public \"stable\" repository. Used for situations where both stable and current repositories are desired.\n\n## A Note About Proxies\n\nIf an HTTP proxy is required to reach the configured repository, then that can be managed outside this cookbook using an apt preferences file. A very simple example can be rendered with a file resource:\n\n```ruby\nfile '/etc/apt/apt.conf.d/01proxy' do\n  content 'Acquire::http::Proxy \"http://proxy.example.com:3128\";'\nend\n```\n\nSee the [apt preferences documentation](https://wiki.debian.org/AptConf) for more information and configurable options.\n\n## License & Authors\n\n**Author:** Cookbook Engineering Team (<cookbooks@chef.io>)\n\n**Copyright:** 2008-2015, Chef Software, Inc.\n```\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n```\n","maintainer":"Chef Software, Inc.","maintainer_email":"cookbooks@chef.io","license":"Apache 2.0","platforms":{"ubuntu":">= 0.0.0"},"dependencies":{"apt":">= 0.0.0"},"recommendations":{},"suggestions":{},"conflicting":{},"providing":{},"replacing":{},"attributes":{},"groupings":{},"recipes":{}}